HomeWork103forEDT/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeWork103forEDT/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

HomeWork103forEDT/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

HomeWork103forEDT/src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

HomeWork103forEDT/src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

HomeWork103forEDT/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
    <balance>true</balance>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Суммовой</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
    <balance>true</balance>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

HomeWork103forEDT/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

HomeWork103forEDT/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41. </code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>50. </code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>60. </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62. </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыССотрудниками</name>
      <description>Расчеты с сотрудниками</description>
      <code>70. </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90. </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.1</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Расходы</name>
        <description>Расходы</description>
        <code>90.2</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

HomeWork103forEDT/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Номенклатура</types>
  </type>
  <predefined>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

HomeWork103forEDT/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Контрагент = Покупатель;
	Движение.Сумма = Сумма;
	Движение.Период = Дата;
	
	Движения.Товары.Записывать = Истина;
	Движения.Товары.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Количество) КАК Количество,
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип КАК НоменклатураТип,
	|	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТоварыИУслуги
	|ГДЕ
	|	РеализацияТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип,
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеДокумента.Количество КАК Количество,
	|	ВТ_ДанныеДокумента.НоменклатураТип КАК ВидНоменклатуры,
	|	ВТ_ДанныеДокумента.Сумма КАК Сумма,
	|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки(
	|				&Период,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ТоварыОстатки
	|		ПО ВТ_ДанныеДокумента.Номенклатура = ТоварыОстатки.Номенклатура";
	
		
	
	Запрос.УстановитьПараметр("ССылка",Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	
	Пока Выборка.Следующий() Цикл
		
		Движения.Доходы.Записывать = Истина;
		Движение = Движения.Доходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Сумма = Выборка.Сумма;
		Движение.Количество = Выборка.Количество;
		
		Если Выборка.ВидНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
			Продолжить;
		КонецЕсли;
		
		НехваткаТовара = Выборка.Количество - Выборка.КоличествоОстаток;
		
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Недостает " + НехваткаТовара + " единиц товара " + Выборка.Номенклатура;
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			Продолжить;
			
		КонецЕсли;
		
		Если Выборка.Количество = Выборка.КоличествоОстаток Тогда
			Себестоимость = Выборка.СуммаОстаток;
		Иначе;
			Себестоимость = Выборка.СуммаОстаток * Выборка.Количество / Выборка.КоличествоОстаток;
			
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата; 
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.Количество;
			Движение.Сумма = Себестоимость;
		КонецЕсли;
		
		Движения.Расходы.Записывать = Истина;
		
		Движение = Движения.Расходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Сумма = Себестоимость;
		
		//Проводка = Движения.Управленческий.Добавить();
		//Проводка.Период = Дата;
		//Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
		//Проводка.СчетКт = ПланыСчетов.Управленческий.Товары;
		//Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		//Проводка.Сумма = Себестоимость;
		
	КонецЦикла;
	
	Проводка = Движения.Управленческий.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
	Проводка.СчетКт = ПланыСчетов.Управленческий.Выручка;
	Проводка.Сумма = Сумма; 
	
	СформироватьДвижениеПоСчетуТовары();
	
КонецПроцедуры 

Процедура СформироватьДвижениеПоСчетуТовары()
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Количество) КАК Количество,
	|	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТоварыИУслуги
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТоварыИУслуги
	|ГДЕ
	|	РеализацияТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыИУслуги.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыИУслуги.Количество КАК Количество,
	|	ВТ_ТоварыИУслуги.Сумма КАК Сумма,
	|	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_ТоварыИУслуги КАК ВТ_ТоварыИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	|				&Период,
	|				Счет = &СчетТовары,
	|				&Субконто,
	|				Субконто1 В
	|					(ВЫБРАТЬ
	|						ВТ_ТоварыИУслуги.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_ТоварыИУслуги КАК ВТ_ТоварыИУслуги)) КАК УправленческийОстатки
	|		ПО ВТ_ТоварыИУслуги.Номенклатура = УправленческийОстатки.Субконто1";
	
	Запрос.УстановитьПараметр("ССылка",Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетТовары",ПланыСчетов.Управленческий.Товары);
	Запрос.УстановитьПараметр("Субконто", ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Выборка.Количество = Выборка.КоличествоОстаток Тогда
			Себестоимость = Выборка.СуммаОстаток;
		ИначеЕсли Выборка.КоличествоОстаток	= 0 Тогда
			Возврат;
		Иначе
			Себестоимость = Выборка.Количество * Выборка.СуммаОстаток / Выборка.КоличествоОстаток;
		КонецЕсли;
		
	Движение = Движения.Управленческий.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.Управленческий.Расходы;
	Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
	Движение.Сумма = Себестоимость;
	Движение.Количество = Выборка.Количество;
	Движение.СубконтоКт = Выборка.Номенклатура;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = ТоварыИУслуги.Итог("Сумма");
	
КонецПроцедуры
